# 1 Reading Data

In [45]:
dictt = {'name':["ram","sita","sudhir","krishna","hari"],
        'age': [17,17,16,15,17],
        'math_score':[90, 40, 80, 98,88],
        'science_score':[70,80,70,100,75]}

In [46]:
import pandas as pd
df = pd.DataFrame(dictt)

In [47]:
df.head()

      name  age  math_score  science_score
0      ram   17          90             70
1     sita   17          40             80
2   sudhir   16          80             70
3  krishna   15          98            100
4     hari   17          88             75

In [48]:
df=pd.read_csv('student_data.csv')

In [49]:
df.head()

      name  age  math_score  science_score
0      ram   17          90             70
1     sita   17          40             80
2   sudhir   16          80             70
3  krishna   15          98            100
4     hari   17          88             75

# 2 Describe Method()

In [8]:
df.describe()

             age  math_score  science_score
count   5.000000    5.000000         5.0000
mean   16.400000   79.200000        79.0000
std     0.894427   22.829805        12.4499
min    15.000000   40.000000        70.0000
25%    16.000000   80.000000        70.0000
50%    17.000000   88.000000        75.0000
75%    17.000000   90.000000        80.0000
max    17.000000   98.000000       100.0000

# 3 Boolean indexing

In [11]:
condition=df['math_score']>85
print(condition)

0     True
1    False
2    False
3     True
4     True
Name: math_score, dtype: bool

In [12]:
df[condition]

      name  age  math_score  science_score
0      ram   17          90             70
3  krishna   15          98            100
4     hari   17          88             75

# 4 Dataframe Sorting

In [13]:
sort_by_math_score=df.sort_values('math_score')

In [14]:
print(sort_by_math_score)

      name  age  math_score  science_score
1     sita   17          40             80
2   sudhir   16          80             70
4     hari   17          88             75
0      ram   17          90             70
3  krishna   15          98            100

In [15]:
sort_by_math_score=df.sort_values('math_score',ascending=False)

In [16]:
print(sort_by_math_score)

      name  age  math_score  science_score
3  krishna   15          98            100
0      ram   17          90             70
4     hari   17          88             75
2   sudhir   16          80             70
1     sita   17          40             80

In [17]:
sort_by_age_and_math_score=df.sort_values(['age','math_score'])

In [18]:
print(sort_by_age_and_math_score)

      name  age  math_score  science_score
3  krishna   15          98            100
2   sudhir   16          80             70
1     sita   17          40             80
4     hari   17          88             75
0      ram   17          90             70

# 5 Cut

In [19]:
bins=[0,40,70,85,100]

In [20]:
label_names=['poor','average','good','very good']

In [21]:
df['math_grade']=pd.cut(df['math_score'],bins,labels=label_names)

In [22]:
df.head()

      name  age  math_score  science_score math_grade
0      ram   17          90             70  very good
1     sita   17          40             80       poor
2   sudhir   16          80             70       good
3  krishna   15          98            100  very good
4     hari   17          88             75  very good

# 6 Grouping

In [39]:
grade_group=df.groupby('math_grade')

In [40]:
grade_group.size()

math_grade
poor         1
average      0
good         1
very good    3
dtype: int64

In [44]:
df.groupby(['math_grade'])['math_score'].min()

math_grade
poor         40.0
average       NaN
good         80.0
very good    88.0
Name: math_score, dtype: float64

In [41]:
grade_age_group=df.groupby(['math_grade','age'])

In [42]:
grade_age_group.size()

math_grade  age
poor        17     1
good        16     1
very good   15     1
            17     2
dtype: int64